qiao-bridge/jms583-hard-drive-box/firmware/stc8g1k08a/project/Bsp/stc8g_ntc_table.c
/*
 * stc8g_ntc_table.c
 * ==================
 * NTC 温度<->RAW 查表（一张表，全 short，无 float）
 *
 * 存储：一维 int16_t 数组 raw_table[146]
 *        下标 i = 温度 + TEMP_OFFSET (= 20)
 *        实际温度 = i - 20   =>  i=0 是 -20C, i=20 是 0C, i=145 是 125C
 *        值 = 该温度对应的 ADC 采集值 RAW
 *
 * RAW 来源：用户 RT 表(R值) + 比值公式
 *         RAW = 1023 * 10k / (R_ntc + 10k)
 *         （上 NTC + 下 10k，VREF=VCC，比值约掉）
 *         已做单调递增修正（相邻最小间隔 1，保证二分正确）
 */

#include "stc8g_ntc_table.h"

/* ============ 查表数据 ============ */
const short raw_table[NTC_TABLE_SIZE] = {
      10,  //  -20C
      10,  //  -19C
      11,  //  -18C
      11,  //  -17C
      12,  //  -16C
      12,  //  -15C
      13,  //  -14C
      14,  //  -13C
      15,  //  -12C
      16,  //  -11C
      18,  //  -10C
      19,  //   -9C
      20,  //   -8C
      21,  //   -7C
      22,  //   -6C
      24,  //   -5C
      25,  //   -4C
      26,  //   -3C
      27,  //   -2C
      29,  //   -1C
      30,  //    0C
      32,  //    1C
      33,  //    2C
      35,  //    3C
      37,  //    4C
      39,  //    5C
      41,  //    6C
      43,  //    7C
      45,  //    8C
      47,  //    9C
      49,  //   10C
      51,  //   11C
      53,  //   12C
      55,  //   13C
      58,  //   14C
      60,  //   15C
      63,  //   16C
      66,  //   17C
      69,  //   18C
      72,  //   19C
      76,  //   20C
      79,  //   21C
      82,  //   22C
      85,  //   23C
      89,  //   24C
      93,  //   25C
      96,  //   26C
     100,  //   27C
     104,  //   28C
     108,  //   29C
     113,  //   30C
     117,  //   31C
     121,  //   32C
     126,  //   33C
     131,  //   34C
     136,  //   35C
     140,  //   36C
     145,  //   37C
     149,  //   38C
     155,  //   39C
     160,  //   40C
     165,  //   41C
     171,  //   42C
     177,  //   43C
     184,  //   44C
     191,  //   45C
     196,  //   46C
     201,  //   47C
     206,  //   48C
     212,  //   49C
     217,  //   50C
     224,  //   51C
     231,  //   52C
     239,  //   53C
     247,  //   54C
     256,  //   55C
     261,  //   56C
     266,  //   57C
     272,  //   58C
     278,  //   59C
     284,  //   60C
     294,  //   61C
     304,  //   62C
     316,  //   63C
     328,  //   64C
     342,  //   65C
     352,  //   66C
     363,  //   67C
     375,  //   68C
     388,  //   69C
     402,  //   70C
     412,  //   71C
     424,  //   72C
     436,  //   73C
     448,  //   74C
     462,  //   75C
     473,  //   76C
     484,  //   77C
     495,  //   78C
     508,  //   79C
     521,  //   80C
     531,  //   81C
     542,  //   82C
     553,  //   83C
     565,  //   84C
     577,  //   85C
     587,  //   86C
     597,  //   87C
     608,  //   88C
     619,  //   89C
     630,  //   90C
     639,  //   91C
     648,  //   92C
     658,  //   93C
     668,  //   94C
     678,  //   95C
     679,  //   96C
     680,  //   97C
     681,  //   98C
     682,  //   99C
     683,  //  100C
     684,  //  101C
     685,  //  102C
     686,  //  103C
     687,  //  104C
     688,  //  105C
     689,  //  106C
     690,  //  107C
     691,  //  108C
     692,  //  109C
     693,  //  110C
     694,  //  111C
     695,  //  112C
     696,  //  113C
     697,  //  114C
     698,  //  115C
     699,  //  116C
     700,  //  117C
     701,  //  118C
     702,  //  119C
     703,  //  120C
     704,  //  121C
     705,  //  122C
     706,  //  123C
     707,  //  124C
     708  //  125C
};

/* ============ 查表函数：RAW -> 温度(℃) ============ */

/*
 * 二分查找 + 整数线性插值
 * 表是单调递增的（温度越高 RAW 越大），找 raw 落在哪两个相邻点之间
 */
int ntc_raw_to_temp(int raw)
{
    int lo, hi, mid;
    int r1, r2;
    int t1, t2;
    int temp;

    /* 边界钳制 */
    if (raw <= raw_table[0]) {
        return NTC_T_MIN;          /* -20C */
    }
    if (raw >= raw_table[NTC_TABLE_SIZE - 1]) {
        return NTC_T_MAX;          /* 125C */
    }

    /* 二分：找第一个 raw_table[mid] > raw 的位置 */
    lo = 0;
    hi = NTC_TABLE_SIZE - 1;
    while (hi - lo > 1) {
        mid = (lo + hi) >> 1;
        if (raw_table[mid] <= raw) {
            lo = mid;
        } else {
            hi = mid;
        }
    }
    /* 此时 raw 在 raw_table[lo] 与 raw_table[hi] 之间 */

    r1 = raw_table[lo];
    r2 = raw_table[hi];
    t1 = lo - TEMP_OFFSET;     /* 实际温度(℃) */
    t2 = hi - TEMP_OFFSET;

    /* 整数线性插值：temp = t1 + (raw - r1) * (t2 - t1) / (r2 - r1) */
    if (r2 - r1 <= 1) {
        /* 两点 RAW 几乎相同（高温区压缩），取中点 */
        temp = (t1 + t2) >> 1;
    } else {
        temp = t1 + (int)(((long)(raw - r1) * (long)(t2 - t1)) / (long)(r2 - r1));
    }

    return temp;
}
